InformationRegisters/ИсторияПеремещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПеремещенийТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияПеремещенийТоваров/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(ПеремещениеСсылка, Дата, Пользователь, Комментарий, ИДЗаписи) Экспорт
		
	МенеджерЗаписи = РегистрыСведений.ИсторияПеремещенийТоваров.СоздатьМенеджерЗаписи();		 
	МенеджерЗаписи.Перемещение = ПеремещениеСсылка; 
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Комментарий = Комментарий;
	МенеджерЗаписи.ИДЗаписи = ИДЗаписи;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры
